import card1 from '../image/กินแซ่บไปหน่อย.png'
import card2 from '../image/DNA แห่งโชคชะตา.png'
import card3 from '../image/ยาเสกน้ำหนัก.png'
import card4 from '../image/มหานครฟาสต์ฟู้ด.png'
import card5 from '../image/ตำรวจตรวจแคล.png'
import card6 from '../image/คาดิโอ.png'
import card7 from '../image/เหนื่อยก็พัก เขาไม่รักก็นอน.png'
import card8 from '../image/คนที่ใจมั่นคงขนาดนี้ เป็นของbabyคนเดียวนะคับ.png'
import card9 from '../image/ก็ของทอดมันเกิดมาอร่อยทำไมล่ะ.png'
import card10 from '../image/ผักผู้พิทักษ์.png'
import card11 from '../image/ไขมันเล่นใจฉันเต้นแบบนี้ ฉันว่าเธอก็มีอาการใช่ไหม๊.png'
import card12 from '../image/ไขมันจะไปพอกตับ ตับตับ ตับ ตับ.png'
import card13 from '../image/เธอมีมันทุกลมหายใจ.png'
import card14 from '../image/กระดูกสู้ไม่ไหว.png'
import card15 from '../image/จอมอ้วน Class III.png'
import card16 from '../image/พี่กล้าวัดกับผมป่าว.png'

import back1 from '../image/black card.png'
import back2 from '../image/black card2.png'

export const assets = {
    back1,
    back2,
}

export const gameData = {
    'กินแซ่บไปหน่อย': {
        image: card1,
        data: 'กินเกินใช้ รับพลังงานมากกว่าที่เผาผลาญ พลังงานสะสมกลายเป็นไขมัน',
        additional: 'การไม่ออกกำลังกายหรือขยับร่างกายน้อย ทำให้ได้รับพลังงานมากกว่าที่ใช้และเกิดการสะสมไขมัน'
    },
    'DNA แห่งโชคชะตา': {
        image: card2,
        data: 'ยีนบางชนิดทำให้เผาผลาญช้ากว่าคนอื่น เพิ่มโอกาสเกิดโรคอ้วน',
        additional: 'การมีฮอร์โมน Leptin สูง อาจทำให้เกิดความอยากอาหารมากขึ้น ซึ่งอาจทำให้ไม่สามารถควบคุมน้ำหนักได้ และการใช้ยาบางชนิด อาจทำให้ระบบเผาผลาญเปลี่ยนแปลงหรือเพิ่มความอยากอาหารได้เช่นกัน'
    },
    'ยาเสกน้ำหนัก': {
        image: card3,
        data: 'ยาบางชนิด เช่น สเตียรอยด์ ยาต้านซึมเศร้า เพิ่มความอยากอาหาร-เสี่ยงอ้วน',
        additional: 'การใช้ยาบางชนิดอาจส่งผลให้ระบบเผาผลาญของร่างกายเปลี่ยนแปลงไป ส่งผลต่อระดับฮอร์โมนในร่างกาย หรืออาจเพิ่มความอยากอาหารได้ ซึ่งอาจส่งผลต่อการควบคุมน้ำหนักและนำไปสู่การสะสมไขมัน เช่น เพรดนิโซน ไฮโดรคอร์ติโซน ยาป้องกันการชัก, ยาต้านฮีสตามีน, และยาบางชนิดที่ใช้รักษาไมเกรน ฯลฯ'
    },
    'มหานครฟาสต์ฟู้ด': {
        image: card4,
        data: 'วิถีชีวิตเร่งรีบ อาหารฟาสต์ฟู้ดเข้าถึงง่าย',
        additional: 'วิถีชีวิตที่เร่งรีบทำให้คนเลือกความสะดวกมากกว่าคุณภาพอาหาร การพึ่งพาอาหารสำเร็จรูป อาหารแปรรูป และเครื่องดื่มหวาน สามารถเข้าถึงอาหารแคลอรีสูงได้ง่ายขึ้น รวมถึงการขยายตัวของธุรกิจอาหารจานด่วนและบริการ Food Delivery'
    },
    'ตำรวจตรวจแคล': {
        image: card5,
        data: 'ปรับพฤติกรรมการกิน คำนวณพลังงานก่อนกิน ป้องกันไขมันสะสม',
        additional: 'ปริมาณสูงสุดที่คนไทยอายุ 6 ปีขึ้นไปไม่ควรได้รับต่อวันคือ พลังงานไม่เกิน 2,000 กิโลแคลอรี, น้ำตาลไม่เกิน 65 กรัม, ไขมันไม่เกิน 65 กรัม, โซเดียมไม่เกิน 2,400 มิลลิกรัม เรียนรู้วิธีการอ่านฉลากโภชนาการ เพื่อดูปริมาณพลังงาน สารอาหาร และร้อยละของปริมาณที่แนะนำต่อวัน เลือกอาหารที่มีไฟเบอร์และโปรตีนสูง ลดอาหารแปรรูป ลดพลังงานอย่างปลอดภัย โดยลดวันละ 500–750 กิโลแคลอรี'
    },
    'คาดิโอ': {
        image: card6,
        data: 'เดินวันละ 30 นาที และออกกำลังกายสม่ำเสมอ ทั้งคาร์ดิโอ เวทเทรนนิ่ง ลดโอกาสโรคอ้วน',
        additional: 'การออกกำลังกายแบบแอโรบิก (Aerobic Exercise): อย่างน้อย 150 นาทีต่อสัปดาห์ ด้วยความเข้มข้นปานกลาง (60-70% ของอัตราการเต้นหัวใจสูงสุด) เช่น เดินเร็ว ว่ายน้ำ ปั่นจักรยาน',
    },
    'เหนื่อยก็พัก เขาไม่รักก็นอน': {
        image: card7,
        data: 'นอนน้อย พักผ่อนไม่พอ รบกวนระบบเผาผลาญ',
        additional: 'นอนให้เป็นเวลาและนอนให้ครบ 7-9 ชั่วโมงต่อคืน เพื่อช่วยควบคุมฮอร์โมนความหิว (ghrelin/leptin)'
    },
    'คนที่ใจมั่นคงขนาดนี้ เป็นของbabyคนเดียวนะคับ': {
        image: card8,
        data: 'เปลี่ยนไลฟ์สไตล์เล็กน้อยแต่สม่ำเสมอ วางเป้าหมายลดน้ำหนักอย่างเป็นระบบ',
        additional: 'ใช้การปรับความคิดและพฤติกรรม (Cognitive Behavioral Therapy: CBT) และการสัมภาษณ์สร้างแรงจูงใจ (Motivational Interviewing) การสนับสนุนด้านจิตใจจากนักจิตวิทยา/นักสุขภาพจิต และจากครอบครัวและสังคมก็มีความสำคัญ'
    },
    'เก็ของทอดมันเกิดมาอร่อยทำไมล่ะ': {
        image: card9,
        data: 'อาหารทอดน้ำมันเยิ้ม เพิ่มทั้งแคลอรี่และไขมันทรานส์',
        additional: 'อาหารที่มีไขมันทรานส์และไขมันอิ่มตัวสูง (Trans & Saturated Fat-Rich Foods) เช่น อาหารทอดหรืออาหารที่มีไขมันสูง เนื่องจากไขมันให้พลังงานสูงถึง 9 กิโลแคลอรีต่อกรัม และอาจเป็นไขมันไม่ดี (LDL) ซึ่งเสี่ยงต่อการเกิดโรค'
    },
    'ผักผู้พิทักษ์': {
        image: card10,
        data: 'ธัญพืชไม่ขัดสี ไฟเบอร์สูง ช่วยอิ่มเร็ว ลดพลังงานสะสม ควบคุมน้ำหนักและสุขภาพ',
        additional: 'โปรตีนไร้มัน (Lean Protein): เป็นแหล่งสารอาหารที่ใช้พลังงานและเวลาในการย่อยมาก ทำให้รู้สึกอิ่มนานขึ้น และยังย่อยเป็นกรดอะมิโนเพื่อซ่อมแซมกล้ามเนื้อ ควรบริโภคโปรตีน 1.5-2.2 กรัมต่อน้ำหนักตัวกิโลกรัมเพื่อรักษามวลกล้ามเนื้อ ไขมันดี (Healthy Fats): เช่น อะโวคาโด น้ำมันมะกอก การบริโภคไขมันดี (HDL) สามารถช่วยลดไขมันไม่ดี (LDL) ในเลือดได้ ซึ่งช่วยควบคุมฮอร์โมนระบบร่างกายต่างๆ และสร้างภูมิคุ้มกันต่อโรค ผักและผลไม้ (Vegetable & Fruit): เป็นอาหารที่มีแคลอรีต่ำ ความหนาแน่นน้อย และมีไฟเบอร์สูง ทำให้รู้สึกอิ่มนานขึ้น'
    },
    'ไขมันเล่นใจฉันเต้นแบบนี้ ฉันว่าเธอก็มีอาการใช่ไหม๊': {
        image: card11,
        data: 'โรคอ้วนเพิ่มโอกาสเป็นความดันโลหิตสูงและโรคหัวใจ',
        additional: 'ไขมันสะสมในผนังหลอดเลือดทำให้เลือดไหลเวียนลำบากส่งผลต่อระบบหัวใจและหลอดเลือด เสี่ยงต่อความดันโลหิตสูงและหัวใจวายได้'
    },
    'ไขมันจะไปพอกตับ ตับตับ ตับ ตับ': {
        image: card12,
        data: 'ไขมันพอกตับ (Fatty Liver) พบได้บ่อยในผู้ที่มีภาวะอ้วน',
        additional: 'ระบบตับและตับอ่อน: ไขมันสะสมในเซลล์ตับอาจทำให้ตับอ่อนแรง ไม่สามารถผลิตอินซูลินได้เพียงพอ นำไปสู่โรคแทรกซ้อน การอักเสบ และภาวะตับแข็งในระยะยาว ระบบเผาผลาญ: ร่างกายอาจผลิตอินซูลินได้ไม่เพียงพอ ทำให้ระบบเผาผลาญต่ำลงและอ้วนได้ง่ายขึ้น'
    },
    'เธอมีมันทุกลมหายใจ': {
        image: card13,
        data: 'โรคอ้วนอาจะทำให้เกิดภาวะหยุดหายใจขณะหลับ',
        additional: 'ไขมันสะสมรอบทรวงอกและช่องท้องทำให้หายใจลำบาก อาจเกิดอาการแทรกซ้อน เช่น หอบหืด อาการกรน การหยุดหายใจขณะหลับ ภาวะคาร์บอนไดออกไซด์คั่ง และภาวะออกซิเจนต่ำเรื้อรัง'
    },
    'เข็มทิศใจมั่นคง': {
        image: card14,
        data: 'โรคอ้วนเพิ่มแรงกดต่อข้อเข่าและกระดูก',
        additional: 'น้ำหนักที่เพิ่มขึ้นส่งผลให้เกิดภาระต่อข้อต่อต่างๆ โดยเฉพาะข้อเข่าและสะโพก เสี่ยงต่อโรคข้อเสื่อมและกระดูกพรุน'
    },
    'จอมอ้วน Class III': {
        image: card15,
        data: 'WHO Class III: BMI ≥ 40 เรียกว่าโรคอ้วนขั้นรุนแรงมาก เสี่ยงโรคร้ายแรงหลายชนิด',
        additional: "เกณฑ์สากล (WHO):\n  1. น้ำหนักเกิน (Overweight): BMI ≥ 25 กก./ม²\n  2. โรคอ้วน (Obesity): BMI ≥ 30 กก./ม²\n      Class I: 30–34.9 กก./ม²\n      Class II: 35–39.9 กก./ม²\n      Class III: ≥ 40 กก./ม² (มักเรียกว่า โรคอ้วนขั้นรุนแรงมาก)\nเกณฑ์สำหรับคนเอเชีย (รวมถึงประเทศไทย):\n  1. น้ำหนักเกิน: BMI ≥ 23 กก./ม²\n  2. โรคอ้วน: BMI ≥ 25 กก./ม²\n  3. โรคอ้วนเสี่ยงสูงมาก: BMI ≥ 27.5 กก./ม²"

    },
    'พี่กล้าวัดกับผมป่าว': {
        image: card16,
        data: 'รอบเอว ≥ 80-90 ซม. ถือว่ามีความเสี่ยงอ้วนลงพุง',
        additional: 'การประเมินไขมันช่องท้อง (เส้นรอบเอว) ผู้ชาย: ≥ 90 ซม. และ ผู้หญิง: ≥ 80 ซม.'
    }
}

